Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_en-US_pt-PT_repaired.tmx
Source language: en_us
Languages: pt_pt

source: Hi!
pt_pt: Olá!

source: Thank you for the feedback!
pt_pt: Agradecemos os comentários!

source: Each animal can only produce a limited amount of goods.
pt_pt: Cada animal só pode produzir uma quantidade de bens limitada.

source: After that, they go to explore other farms but leave you berries as a thank you :)
pt_pt: Depois disso, vão explorar outras quintas, mas deixam-te bagas como forma de agradecimento :)

source: Join in the Winterfest fun and magical delights!
pt_pt: Junta-te à diversão do Festival de Inverno!

source: Love is everywhere!
pt_pt: O amor está no ar!

source: Dress up your heroes and check out the new event.
pt_pt: Veste os teus heróis e não percas o novo evento!

source: Complete quests, play bingo, and earn rewards!
pt_pt: Conclui missões, joga bingo e ganha recompensas!

source: Elevate your favorite heroes to a whole new level in the Talisman Keepers event!
pt_pt: Leva os teus heróis favoritos para outro nível no evento Guardiões dos Talismãs!

source: It’s time to power up your favorite Heroes even more!
pt_pt: Hora de melhorar ainda mais os teus Heróis favoritos!

source: Complete event quests to obtain new Talismans for Astrid & Lucas, K'arkh, Krista, Lars, Lilith, and Ziri, as well as all the resources for upgrading these magical items!
pt_pt: Conclui missões de evento e obtém Talismãs para Astrid e Lucas, K'arkh, Krista, Lars, Lilith e Ziri, assim como recursos para os melhorares!

source: Get bonus stats for your characters and defeat your enemies!
pt_pt: Melhora as estatísticas dos teus Heróis e derrota os teus inimigos!

source: A grand update! Hero Wars’ 5th birthday Our game is turning 5! And what birthday is complete without a cake? Gather your friends and bake the biggest cake in the whole Dominion. Campaign map update It’s even better and more convenient to use now — unforeseen obstacles won’t stand between your righteous wrath and the Archdemon’s minions anymore! Galactic sale A whole week of discounts on cool items, including amazing neon dragon avatars! Carry on defending the Dominion together with us!
pt_pt: Grande atualização! 5.º aniversário do Hero Wars O jogo faz 5 anos, por isso tem de haver bolo! Junta os amigos e faz o maior bolo do Domínio. Atualização do mapa da campanha Melhor e mais conveniente: já não haverá obstáculos invisíveis a impedir-te de alcançar os lacaios do Archdemon! Promoção galáctica Uma semana inteira de descontos em itens fixes, como os avatares de dragões! Continua a defender o Domínio connosco!

source: Now all servers you have ever progressed on are listed in a specific tab.
pt_pt: Os servidores que já usaste serão listados num separador específico.

source: We've also improved server browsing to simplify your choice!
pt_pt: Também melhorámos a navegação no servidor para simplificar as tuas escolhas!

source: Talisman Keepers
pt_pt: Guardiões dos Talismãs

source: Have fun!
pt_pt: Diverte-te!

source: Fight alongside friends and guildmates alike, and test your skills in PvP!
pt_pt: Luta ao lado de amigos e membros da guilda, mostra o que vales no PvP!

source: New Lunar Skins in Hero Wars!
pt_pt: Visuais Lunares no Hero Wars!

source: Power up the genius mage in April!
pt_pt: Reforça o genial mago neste abril!

source: Enjoy the RPG story!
pt_pt: Desfruta da história RPG!

source: It’s time to build your legend, play Hero Wars today and become a hero
pt_pt: Faz crescer a tua lenda, joga Hero Wars hoje e torna-te num herói

source: auto-fighting
pt_pt: combate automático

source: We are counting on you, Brave Hero!
pt_pt: Contamos contigo, Bravo Herói!

source: So much loot!
pt_pt: Tanto saque!

source: Bulgarian Lev
pt_pt: Lev búlgaro

source: HELP THE VICTIM
pt_pt: AJUDAR A VÍTIMA

source: Meet Oya, the chieftain of a lost tribe, and add her to your team!
pt_pt: Conhece Oya, a chefe de uma tribo perdida e adiciona-a à tua equipa!

source: Mort has come to the Dominion!
pt_pt: Mort chegou ao Domínio!

source: New Dark Titan Complete quests during this limited-time event and spend your rewards in a special shop to obtain Mort and make his terrible powers even stronger!
pt_pt: Novo Titã das Trevas Conclui missões neste evento limitado e gasta as tuas recompensas na loja especial para obteres o Mort e melhorar ainda mais o seu poder avassalador!

source: Become the lord of darkness!
pt_pt: Veste a pele do senhor das trevas!

source: No pressure, but it all comes down to YOU What's the move?
pt_pt: Não te atrapalhes, mas depende tudo de TI O que vais fazer?

source: Save
pt_pt: Guardar

source: BONUS LEVEL
pt_pt: NÍVEL BÓNUS

source: Win big and embrace the coming spring with the new Battle Pass!
pt_pt: Ganha à grande e dá as boas-vindas à primavera com o novo Passe de Batalha!

source: Join the fun!
pt_pt: Entra na diversão!

source: Fight the boss, get new Stellar Skins as well as a Superskin for Andvari, and lots of goodies in the shop!
pt_pt: Enfrenta o boss, obtém visuais estelares, um supervisual para Andvari e montes de ofertas na loja!

source: HER EX
pt_pt: O EX DELA

source: New improvements already in-game!
pt_pt: Novas melhorias já no jogo!

source: Check out what's new!
pt_pt: Espreita as novidades!

source: The new Titan is illuminating the Dominion!
pt_pt: Um novo Titã ilumina o Domínio!

source: Julius, the Interstellar Wanderer, is here to win battles and your hearts!
pt_pt: Julius, o Viajante Galáctico, quer vencer batalhas e conquistar corações!

source: Enrich your team with the cutest tank ever!
pt_pt: A tua equipa precisa deste tanque fofo!

source: It's time for some transformations!
pt_pt: Está na altura de transformações!

source: Celestial Skins Kayla, Octavia, and Aidan have received some ethereal new outfits!
pt_pt: Visuais Celestiais Kayla, Octavia e Aidan receberam novos fatos etéreos!

source: And you can give Octavia's skin an additional upgrade to elevate her look even more!
pt_pt: E podes dar ao visual de Octavia uma melhoria adicional para ficar com ainda mais pinta!

source: Transforming Dominion Classy Heroes deserve a classy city!
pt_pt: Transformando o Domínio Heróis cheios de classe merecem uma cidade com classe!

source: Check out the new main screen design and the updated UI—you're in for some pleasant surprises!
pt_pt: Espreita o novo design do ecrã principal e a IU atualizada e prepara-te para surpresas agradáveis!

source: Defeat your foes in style!
pt_pt: Derrota os teus inimigos com estilo!

source: Throne rush — Online strategy game by Nexters
pt_pt: Throne Rush — Jogo de estratégia online da Nexters

source: A new Battle Pass with valuable quest rewards and an outfit for Mushy & Shroom!
pt_pt: Um novo Passe de Batalha cheio de recompensas e um visual para Mushy e Shroom!

source: This game will keep you up all night!
pt_pt: Este jogo vai manter-te acordado toda a noite!

source: • Find them next to missions on the Campaign map
pt_pt: • Podes encontrá-los junto às missões no mapa de Campanha

source: The Dominion Day Update!
pt_pt: A Atualização do Dia do Domínio!

source: Celebration Event The world-famous chefs are busy baking a huge cake, and as the cherry on top, the Archdemon himself has prepared a surprise for you!
pt_pt: Celebração do Evento Os famosos chefs estão ocupados a fazer um bolo enorme, e a cereja no bolo é que o Grão-Demónio te preparou uma surpresa!

source: Fight the unexpected guest and complete event quests to stock up in the special shop!
pt_pt: Combate o convidado inesperado e conclui missões de eventos para te abasteceres na loja especial!

source: Stellar Skins Iris, Sebastian, and Fafnir are getting shiny new outfits for the occasion.
pt_pt: Visuais Estelares Iris, Sebastian e Fafnir vão receber fatos novos para a ocasião.

source: Don't miss out on the chance to doll up your Heroes and give Iris's skin an extra upgrade!
pt_pt: Não percas a oportunidade para embelezar os teus Heróis e dar uma melhoria extra ao visual de Iris!

source: See you at the main square!
pt_pt: Vemo-nos na praça principal!

source: Charming Power of Nature
pt_pt: O poder encantador da natureza

source: Celebrate St. Valentine’s Day in the Dominion!
pt_pt: Celebra o dia de S. Valentim no Domínio!

source: Take on a new challenge, do your best to win!
pt_pt: Aceita o desafio e tenta vencer!

source: The PVP Arena
pt_pt: A Arena PvP

source: THANKS
pt_pt: OBRIGADO

source: The Throne Rush Website uses cookies and similar technologies necessary to provide You with the best quality Services.
pt_pt: O site de Throne Rush utiliza cookies e tecnologias semelhantes necessárias para Te fornecer Serviços da melhor qualidade.

source: By continuing to use the Website You accept the Cookie Policy.
pt_pt: Ao continuares a utilizar o Site, aceitas a Política de Cookies.

source: Earn resources and enjoy spring with the Battle Pass!
pt_pt: Ganha recursos na primavera com o Passe de Batalha!

source: Unlock the Premium Pass for a seasonal avatar and a flower frame!
pt_pt: Desbloqueia o Passe Premium e obtém um avatar e uma moldura de flor!

source: Enjoy new amusing skins for your heroes!
pt_pt: Desfruta de visuais divertidos para os heróis!

source: Winterfest has come to the Dominion!
pt_pt: O Festival de Inverno chegou ao Domínio!

source: You're in for a lot of fun activities, exciting events, and special holiday releases.
pt_pt: Prepara-te para atividades divertidas, eventos emocionantes e lançamentos especiais festivos.

source: Log into the game and join in on the magical atmosphere!
pt_pt: Inicia sessão e junta-te à atmosfera mágica!

source: These fresh finds suit you!
pt_pt: Estas novidades parecem feitas para ti!

source: Black Friday The Grand Sale is back: the Dominion’s traders are being especially generous!
pt_pt: Black Friday A Grande Promoção voltou e os comerciantes do Domínio estão a sentir-se especialmente generosos!

source: Mechanization Protocol Fox, Amira, and Iris look like the heroes of the future in their new cybernetic skins.
pt_pt: Protocolo de Mecanização Fox, Amira e Iris parecem ter vindo do futuro com os seus visuais cibernéticos.

source: Amira’s skin can be further upgraded in an upcoming event!
pt_pt: O visual de Amira pode ser melhorado num próximo evento!

source: Winter is Coming New Year’s preparations start on December 1st: get ready for winter events, daily rewards, and a grand celebration at the end of the month!
pt_pt: O inverno Está à Porta Começa a preparar a Passagem de Ano a partir de 1 de dezembro: eventos de inverno, recompensas diárias e uma grande festa no fim do mês!

source: See you in the Dominion!
pt_pt: Vemos-te no Domínio!

source: Privacy and Cookie Policy
pt_pt: Política de Privacidade e Cookies

source: Payments
pt_pt: Pagamentos

source: Dominion Day!
pt_pt: Dia do Domínio!

source: Unknown user
pt_pt: Utilizador desconhecido

source: Log in
pt_pt: Inicia sessão

source: Halloween Black Friday
pt_pt: Black Friday deHalloween

source: A small update, by player request!
pt_pt: Pequena atualização a pedido dos jogadores!

source: A very healthy change Hydra's Head health is now displayed in the Goal Selection screen.
pt_pt: Alteração cheia de vida A vida da Cabeça de Hidra passa a ser apresentada no ecrã de seleção de objetivo.

source: - Added Skin Shop Certificates and unique Skins which can't be found in the Shop
pt_pt: - Adicionámos Certificados da Loja de Visuais e visuais exclusivos à Loja

source: Evolve whole Hero Classes in one go!
pt_pt: Evolui Classes de Heróis de uma só vez!

source: Complete quests, win fights, and upgrade Class Runes!
pt_pt: Conclui missões, ganha combates e melhora Runas de Classe!

source: HELP HER
pt_pt: AJUDA-A

source: TRY AGAIN
pt_pt: TENTAR OUTRA VEZ

source: 5 hours
pt_pt: 5 horas

source: Change your old password to a new password
pt_pt: Altera a tua palavra-passe antiga para uma nova

source: Hero Wars: Fight for Glory ⚔️
pt_pt: Hero Wars: Luta por Glória ⚔️

source: Darkness has granted the Titans otherworldly power and brought them to the Brawl Arena.
pt_pt: A Escuridão deu aos Titãs poderes inimagináveis e trouxe-os para a Arena de Brigas.

source: Assemble your invincible team and defeat other players!
pt_pt: Cria uma equipa invencível e derrota os teus adversários!

source: Each victory will give you event coins that can be exchanged for useful resources for your Titans and Heroes, as well as an extravagant chest with an artifact for Tenebris!
pt_pt: Cada vitória dá-te moedas de evento que podes trocar por recursos para os teus Titãs e Heróis, assim como um baú extravagante com um artefacto para Tenebris!

source: Don’t miss this rare opportunity to collect and upgrade one of the very strongest Super Titans!
pt_pt: Não percas esta oportunidade de obter e melhorar um dos Super Titãs mais poderosos de sempre!

source: Enjoy Hero Wars?
pt_pt: Gostas de Hero Wars?

source: Subscribe to our official channels for special gifts!
pt_pt: Subscreve os nossos canais oficiais para receberes presentes especiais!

source: Join in
pt_pt: Entra

source: Become a real hero with this February's Battle Pass!
pt_pt: Mostra o teu lado heroico com o Passe de Batalha de fevereiro!

source: Unique Sale!
pt_pt: Promoção única!

source: Upgrade your Guardians & Titans at lower prices and get new Cybernetic Skins for Amira, Iris and Fox!
pt_pt: Melhora os teus Guardiões e Titãs com desconto e ganha visuais cibernéticos para Amira, Iris e Fox!

source: There's a new Hero in the Dominion!
pt_pt: Há uma nova Heroína no Domínio!

source: Take part in our special event to meet the great Empress Octavia and dive into the legends of the past and the history of the Guardians.
pt_pt: Participa no nosso evento especial para conhecer a grande Imperatriz Octavia e mergulhar nas lendas do passado e na história dos Guardiões.

source: You have a whole week to try Octavia out in battle, sample the power of the new Guardian and make her a part of your team.
pt_pt: Tens uma semana para experimentar Octavia na batalha, analisar o poder da nova Guardiã e torná-la parte da tua equipa.

source: Challenge your fears in an adventure full of nightmares and help Octavia escape from the Pumpkin King!
pt_pt: Desafia os teus medos numa aventura repleta de pesadelos e ajuda Octavia a escapar do Rei Abóbora!

source: Compete against other players in real-time and win prizes!
pt_pt: Compete com outros jogadores em tempo real e ganha prémios!

source: Come join the merry fray!
pt_pt: Junta-te à luta!

source: Complete event quests to get Isaac, Orion, and Aidan their 1st Talismans, and Dante, Heidi, and Chabba their 2nd ones!
pt_pt: Conclui missões para obter os primeiros Talismãs para Isaac, Orion e Aidan e os segundos para Dante, Heidi e Chabba!

source: Fun in the sun! Beach Season Complete this event’s quests to receive coins and spend them in the special shop! You can get colorful frames and avatars there, as well as nice offers on valuable resources! Sunny Skies Fashion Rufus, Iris, Satori, and Xe'Sha got themselves some comfy new threads to sunbathe in for the summer. You can also give Xe'Sha’s skin that extra upgrade to make her shine brighter than sea spray! And don’t forget your sun hat!
pt_pt: Diverte-te ao sol! Temporada de Praia Conclui as missões deste evento para receber moedas e gasta-as na loja especial! Moda Céus Ensolarados Rufus, Iris, Satori e Xe'Sha arranjaram roupas confortáveis para apanhar banhos de sol no verão. Também podes dar ao visual de Xe'Sha’s uma melhoria adicional que a fará brilhar mais que a maresia! E não te esqueças do teu chapéu!

source: Next
pt_pt: Seguinte

source: A new chance to prove yourself!
pt_pt: Mostra o que vales!

source: Dominion Day The Archdemon is going to crash the party!
pt_pt: Dia do Domínio O Grão-Demónio vai atacar a festa!

source: Foil his plans, save the day, and earn valuable rewards.
pt_pt: Impede os seus planos, salva o dia e ganha recompensas.

source: Keros Returns Darkness is on the rise once more!
pt_pt: O Regresso de Keros As trevas voltam a ganhar força!

source: Take this opportunity to power up Keros and other titans.
pt_pt: Aproveita para reforçar Keros e outros titãs.

source: Stellar Skins Andvari, Tristan, and Markus look divine in these new skins!
pt_pt: Visuais Espetaculares Andvari, Tristan e Markus serão divinais com estes visuais!

source: Moreover, upgrade Andvari's skin to boost his stats and add some otherworldly fashion to the mix.
pt_pt: Para além disso, melhora o visual de Andvari para reforçar os atributos e dar-lhe um toque do outro mundo.

source: May the light of your heroic deeds dawn upon the Dominion!
pt_pt: Que a luz do teu heroísmo ilumine o Domínio!

source: The missing Empress is back!
pt_pt: A Imperatriz está de volta!

source: Welcome Octavia to the ranks of Support Heroes.
pt_pt: Dá as boas-vindas a Octavia aos Heróis de Suporte.

source: Hero's Way
pt_pt: Caminho do Herói

source: Go Out Guns Blazing!
pt_pt: Dá tudo por tudo!

source: Hero Wars is an online idle RPG fantasy game.
pt_pt: Hero Wars é um RPG de fantasia ocioso.

source: Clash with the Archdemon and his evil army in epoch-shaping battles and collect epic heroes along the way.
pt_pt: Combate contra o Grão-Demónio e o seu exército malvado em enormes batalhas e recolhe heróis épicos pelo caminho.

source: A sensational adventure awaits!
pt_pt: Aguarda-te uma aventura sensacional!

source: New Things! Fluffy Scamps The Leprecats are invading the Dominion again! Take part in fun events, help Mayor Luckypaws gather Leprecoins, and claim rewards. Progress Parade Progress marches on! It’s time to gather the Way of Progress heroes for a special event and enhance their power. Curious Improvements Loading times are faster, and game responsiveness has been improved. The UI of some windows has been reworked. The tutorial and starting missions are more engaging. All Hail Progress!
pt_pt: Novidades! Marotos Fofinhos Os Gnomolinos estão a invadir o Domínio. Outra vez! Participa em evento divertidos, ajuda o Luckypaws, ganha Gnomoedas e recompensas. Desfile do Progresso Viva o progresso! Vamos reunir os heróis do Caminho do Progresso neste evento especial e melhorar os seus poderes. Melhorias Curiosas Os carregamentos estão mais rápidos e o jogo mais fluído. Alterámos a IU de algumas janelas. O tutorial e as missões iniciais estão mais interessantes. Viva o progresso!

source: • Heidi’s new skin will increase his magic attack.
pt_pt: • O novo visual de Heidi vai melhorar o seu ataque mágico.

source: Sign up
pt_pt: Regista-te

source: You have only 2 moves
pt_pt: Só tens duas jogadas

source: Morrigan's Brawls!
pt_pt: Brigas da Morrigan!

source: <p><span class="text-colored">...magnificent lands</span> of the Dominion were thriving and blossoming.</p><p class="text-padding"><span class="text-colored">Until</span> the perfect world was invaded by the evil forces of Archdemon who wanted to conquer it.</p><p class="text-padding">His army is unbelievably <span class="text-colored">strong</span> and extremely cruel, but there has to be someone to fight it.</p>
pt_pt: <p><span class="text-colored">...as terras magníficas</span> de Dominion prosperavam e cresciam.</p><p class="text-padding"><span class="text-colored">Até</span> que este mundo perfeito foi invadido pelas forças malignas do Archdemon, que queria conquistá-lo.</p><p class="text-padding">O seu exército é incrivelmente <span class="text-colored">poderoso</span> e extremamente cruel, mas tem de haver alguém capaz de o enfrentar.</p>

source: Get my blessing and collect rewards every day!
pt_pt: Recebe a minha bênção para recolher recompensas diárias!

source: The adventure begins!
pt_pt: A aventura começa!

source: Meet the mighty warrior, Oya!
pt_pt: Conhece a incrível guerreira, Oya!

source: Her powerful strikes can break through any defenses, unleashing the true power of Nature!
pt_pt: Os seus golpes atravessam quaisquer defesas e mostram o verdadeiro poder da Natureza!

source: It's special offer time in the Dominion! Make your Guardians stronger with Cybernetic Skins and a special outfit for Yasmine, use the various items on offer to upgrade your Heroes and Titans, and don't forget to do the event quests to earn some useful resources!
pt_pt: Mais uma oferta especial no Domínio! Usa os visuais Cibernéticos e os itens da oferta para melhorar os teus Guardiões,Heróis e Titãs. Obtém um visual especial para Yasmine e não te esqueças de concluir missões para obter ainda mais recursos!

source: Start the year with this January's Battle Pass!
pt_pt: Comece o ano com este Battle Pass de Janeiro!

source: New resources and a unique avatar with a striking frame await!
pt_pt: Novos recursos e um avatar exclusivo com uma moldura incrível aguardam!

source: An update full of feelings! The Phoenix Festival Ancient spirit has awoken! Assemble a team of heroes to participate in the event, defeat a mighty foe, and claim rewards for your valiant efforts. Enough Said Dozens of new emojis added to the chat! Express yourself in your messages! Better Than Ever Spring is here: nature is renewing itself, and so are the graphics in the combat pause menu! Burning hearts banish the winter cold!
pt_pt: Uma atualização sentimental! O Festival da Fénix! O espírito ancestral acordou! Cria uma equipa de heróis para o evento, derrota um inimigo poderoso e recebe recompensas pela tua valentia. Não Há Palavras Adicionámos dezenas de emojis ao chat! Mostra o que sentes nas tuas mensagens! Melhor Que Nunca A Primavera chegou: a natureza renova-se, assim como os gráficos no menu de pausa do combate! Corações ardentes afastam o frio invernal!

source: The new Hero, Folio, is coming to the Hero Wars Universe!
pt_pt: Folio, o novo herói, chega ao Universo Hero Wars!

source: What else do you need, pretty talking head?
pt_pt: Queres melhor, minha bela cabeça tagarela?

source: Log out
pt_pt: Termina sessão

source: All September, the fearless warrior Aurora’s unprecedented strength will shine!
pt_pt: Durante setembro, a força sem limites de Aurora está em destaque!

source: Winter Skin Sale!
pt_pt: Promoção de Visuais de Inverno

source: Hi there!
pt_pt: Olá, viva!

source: You need to press the buttons that are indicated on the fresco.
pt_pt: Tens de premir os botões que estão indicados no fresco.

source: To find that fresco, please go right from the sundial — you'll see the door with the fresco in the lower right corner of the location.
pt_pt: Para descobrires o fresco, vai pela direita do relógio de sol: vais ver a porta com o fresco no canto inferior direito do local.

source: Hope this helps!
pt_pt: Espero ter ajudado!

source: Get ready for adventure!
pt_pt: Prepara-te para a aventura!

source: Speed Up Combat
pt_pt: Acelerar Combate

source: ROB HER
pt_pt: ROUBA-A

source: The figurines are waiting for you in different parts of the location.
pt_pt: As figuras esperam por ti em diferente partes deste local.

source: Try going to every possible direction covered with the fog to explore it, even if it doesn’t look obvious!
pt_pt: Tenta explorar todas as direções possíveis, que estão ocultas em nevoeiro, mesmo que não sejam óbvias!

source: For example, make sure to go past the trap that the native friend of Emily’s got into after you release him.
pt_pt: Por exemplo, não te esqueças de passar a armadilha que capturou o amigo nativo da Emily, depois de o libertares.

source: Good luck :)
pt_pt: Boa sorte :)
